{"basics":{"name":"Varun Sampath Kumar","label":"PhD Student","image":"","email":"vaku@mmmi.sdu.dk","phone":"","url":"https://Lordvarun23.github.io","summary":"PhD researcher in Responsible AI, specializing in efficient machine unlearning algorithms for both vision (discriminative and generative) models and large language models (LLMs).","location":{"address":"Mærsk 2, Campusvej 55","postalCode":"5230","city":"Odense M","countryCode":"DK","region":"Odense"},"profiles":[{"network":"LinkedIn","username":"varun-sampath-kumar","url":"https://www.linkedin.com/in/varun-sampath-kumar/"}]},"work":[{"name":"KLA","position":"Software Engineering Intern","url":"","startDate":"2024-12-17","endDate":"2025-06-27","summary":"Worked on large-scale data management, query optimization, and data ingestion pipelines.","highlights":["Implemented a rule-based maintenance plan for Apache Iceberg tables using PySpark and Nessie GC, enabling efficient data cleanup and optimization.","Designed and deployed a FastAPI-based dashboard to visualize real-time Iceberg table metrics and trigger maintenance operations via PyIceberg and PySpark.","Optimized an existing clustering algorithm, achieving a 3–4× execution time improvement using OpenMP, and explored distributed processing with Ray.","Generated and ingested 520 billion records to benchmark Trino and DuckDB performance using Ibis, evaluating large-scale query efficiency.","Contributed to the DuckDB Iceberg extension, resolving issues with DayTransform partition handling to enhance query latency."]},{"name":"KLA","position":"Software Engineering Intern","url":"","startDate":"2024-05-07","endDate":"2024-07-05","summary":"Worked on database performance optimization, memory management in WPF applications, and LLM-based system log analysis.","highlights":["Optimized large-scale data processing by profiling code, rewriting SQL queries, and replacing legacy DB connectors (SourcePro → Pro*C).","Resolved critical WPF memory issues by diagnosing and fixing Out-of-Memory exceptions, improving application stability.","Fine-tuned a large language model (LLM) to analyze system metrics and application logs during a hackathon, enabling automated error diagnosis and resolution suggestions."]},{"name":"KLA","position":"Software Engineering Intern","url":"","startDate":"2023-06-01","endDate":"2023-11-30","summary":"Worked on self-supervised representation learning and model optimization for wafer defect classification pipelines.","highlights":["Developed an image clustering pipeline leveraging self-supervised representation learning techniques.","Improved the wafer defect classification pipeline performance by 1.25× through pretraining-based feature enhancement.","Accelerated the inference pipeline by 2.5× using model quantization, operator fusion, and pruning techniques.","Prototyped a gRPC-based image streaming system that reduced latency by 4× compared to SFTP."]}],"education":[{"institution":"University Of Southern Denmark","location":"Odense, Denmark","area":"Responsible AI","studyType":"PhD","startDate":"2025-08-01","endDate":"2028-07-30"},{"institution":"PSG College Of Technology","location":"Tamil Nadu, India","area":"Data Science","studyType":"Integrated MSc","startDate":"2020-08-10","endDate":"2025-06-17","score":"8.7/10.0"}],"skills":[{"name":"Programming & Tools","level":"","keywords":["Python","C++","SQL","PyTorch","TensorFlow","Keras","Scikit-Learn","Numpy","Pandas","SpaCy","NLTK","DuckDB","PySpark","Docker","Flask","Postman","Git"]}]}